app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `newsletter_subscribers`
SELECT COUNT(*) AS `numrows` FROM `formations`
SELECT COUNT(*) AS `numrows` FROM `ressources`
SELECT COUNT(*) AS `numrows` FROM `contact_messages`
SELECT *
FROM `contact_messages`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `newsletter_subscribers`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function index()
    {
        $formationModel  = new FormationModel();
        $ressourceModel  = new RessourceModel();
        $newsletterModel = new NewsletterModel();

        $db = \Config\Database::connect();

        $data = [
            'title'          => 'Tableau de bord',
            'nb_formations'  => $formationModel->countAll(),
            'nb_ressources'  => $ressourceModel->countAll(),
            'nb_abonnes'     => $newsletterModel->countAll(),
            'nb_messages'    => $db->table('contact_messages')->countAll(),
            'last_messages'  => $db->table('contact_messages')->orderBy('created_at', 'DESC')->limit(5)->get()->getResultArray(),
            'last_abonnes'   => $db->table('newsletter_subscribers')->orderBy('created_at', 'DESC')->limit(5)->get()->getResultArray(),
        ];