app/Controllers/Admin/Formations.php

SELECT *
FROM `formations`
ORDER BY `created_at` DESC
---
    public function index()
    {
        return $this->render('admin/formations/index', [
            'title'      => 'Formations',
            'formations' => $this->model->orderBy('created_at', 'DESC')->findAll(),

SELECT *
FROM `modules`
WHERE `modules`.`id` = 10
INSERT INTO `lecons` (`module_id`, `titre`, `type`, `duree`, `video_url`, `is_free`, `position`, `created_at`, `updated_at`) VALUES (10, 'lec 2', 'quiz', 10, '', 1, 2, '2026-07-06 21:13:36', '2026-07-06 21:13:36')
---
    public function storeLecon(int $moduleId)
    {
        $module = $this->moduleModel->find($moduleId);
        if (! $module) {
            return redirect()->back()->with('error', 'Chapitre introuvable.');
        }
        $titre = trim($this->request->getPost('titre'));
        if ($titre) {
            $this->leconModel->insert([
                'module_id' => $moduleId,
                'titre'     => $titre,
                'type'      => $this->request->getPost('type') ?? 'video',
                'duree'     => (int)$this->request->getPost('duree'),
                'video_url' => $this->request->getPost('video_url') ?? '',
                'is_free'   => (int)$this->request->getPost('is_free'),
                'position'  => $this->leconModel->nextPosition($moduleId),
            ]);