app/Models/FormationModel.php

    public function getAll(int $limit = 0): array
    {
        $builder = $this->orderBy('sort_order', 'ASC')->orderBy('created_at', 'DESC');
        return $limit > 0 ? $builder->findAll($limit) : $builder->findAll();
---
SELECT *
FROM `formations`
ORDER BY `sort_order` ASC, `created_at` DESC
 LIMIT 3

    public function getFiltered(?string $niveau, ?string $theme): array
    {
        $builder = $this->orderBy('sort_order', 'ASC');

        if ($niveau && $niveau !== 'tous') {
            $builder->where('niveau', $niveau);
        }
        if ($theme && $theme !== 'tous') {
            $builder->where('theme', $theme);
        }

        return $builder->findAll();
---
SELECT *
FROM `formations`
ORDER BY `sort_order` ASC

    public function getBySlug(string $slug): ?array
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `formations`
WHERE `slug` = 'cv-parfait-decrocher-entretien'
 LIMIT 1

    public function getModules(int $formationId): array
    {
        $modules = $this->db->table('modules')
            ->where('formation_id', $formationId)
            ->orderBy('position', 'ASC')
            ->get()->getResultArray();

        foreach ($modules as &$module) {
            $module['lecons'] = $this->db->table('lecons')
                ->where('module_id', $module['id'])
                ->orderBy('position', 'ASC')
                ->get()->getResultArray();
---
SELECT *
FROM `modules`
WHERE `formation_id` = 1
ORDER BY `position` ASC
SELECT *
FROM `lecons`
WHERE `module_id` = '3'
ORDER BY `position` ASC