app/Models/LeconModel.php

    public function getByModule(int $moduleId): array
    {
        return $this->where('module_id', $moduleId)
                    ->orderBy('position', 'ASC')
                    ->findAll();
---
SELECT *
FROM `lecons`
WHERE `module_id` = 10
ORDER BY `position` ASC

    public function nextPosition(int $moduleId): int
    {
        $row = $this->selectMax('position')->where('module_id', $moduleId)->first();
---
SELECT MAX(`position`) AS `position`
FROM `lecons`
WHERE `module_id` = 10
 LIMIT 1