app/Models/ModuleModel.php

    public function getByFormation(int $formationId): array
    {
        return $this->where('formation_id', $formationId)
                    ->orderBy('position', 'ASC')
                    ->findAll();
---
SELECT *
FROM `modules`
WHERE `formation_id` = 2
ORDER BY `position` ASC