app/Models/RessourceModel.php

    public function getFree(int $limit = 0): array
    {
        $builder = $this->where('is_premium', 0)->orderBy('sort_order', 'ASC');
        return $limit > 0 ? $builder->findAll($limit) : $builder->findAll();
---
SELECT *
FROM `ressources`
WHERE `is_premium` = 0
ORDER BY `sort_order` ASC
 LIMIT 3

    public function getPremium(int $limit = null, ?string $type = null, ?string $profil = null): array
    {
        $builder = $this->where('is_premium', 1)->orderBy('sort_order', 'ASC');

        if ($type && $type !== 'tous') {
            $builder->where('type', $type);
        }
        if ($profil && $profil !== 'tous') {
            $builder->where('profil', $profil);
        }

        return $limit > 0 ? $builder->findAll($limit) : $builder->findAll();
---
SELECT *
FROM `ressources`
WHERE `is_premium` = 1
ORDER BY `sort_order` ASC
 LIMIT 4

    public function getBySlug(string $slug): ?array
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `ressources`
WHERE `slug` = 'kit-candidat-complet'
 LIMIT 1

    public function incrementViewCount(int $id): void
    {
        $db = $this->db;
        if (! $db->fieldExists('view_count', $this->table)) {
            return;
        }

        $db->table($this->table)
            ->set('view_count', 'COALESCE(view_count, 0) + 1', false)
            ->where('id', $id)
            ->update();
---
UPDATE `ressources` SET `view_count` = COALESCE(view_count, 0) + 1
WHERE `id` = 4