app/Models/SettingsModel.php

SELECT *
FROM `settings`
---
    public function getAll(): array
    {
        $rows = $this->findAll();