app/Models/TestimonialModel.php

SELECT *
FROM `testimonials`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
    public function getActive(): array
    {
        return $this->where('is_active', 1)
                    ->orderBy('sort_order', 'ASC')
                    ->findAll();